# SQL

### Demonstration simple and hard queries

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# устанавливаем параметры
db_config = {'user': '',         
             'pwd': '', 
             'host': '',
             'port': ,             
             'db': ''} 
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                        db_config['pwd'],
                                                        db_config['host'],
                                                        db_config['port'],
                                                        db_config['db'])
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [3]:
# полчучаем данные таблицы books
query = '''
            SELECT * FROM books
        '''
# подключения к базе данных для Sqlite
books = pd.io.sql.read_sql(query, con = engine)

books.head()

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [4]:
# получаем данные таблицы books
query = '''
            SELECT * FROM books
        '''
# подключения к базе данных для Sqlite
books = pd.io.sql.read_sql(query, con = engine)

books.head()

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [5]:
# проверим размерности датасетов
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

In [6]:
# получаем данные таблицы authors
query = '''
            SELECT * FROM authors
        '''
# подключения к базе данных для Sqlite
authors = pd.io.sql.read_sql(query, con = engine)

authors.head()

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [7]:
# проверим размерности датасетов
authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB

In [8]:
# получаем данные таблицы publishers
query = '''
            SELECT * FROM publishers
        '''
# подключения к базе данных для Sqlite
publishers = pd.io.sql.read_sql(query, con = engine)

publishers.head()

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [9]:
# проверим размерности датасетов
publishers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [10]:
# получаем данные таблицы ratings
query = '''
            SELECT * FROM ratings
        '''
# подключения к базе данных для Sqlite
ratings = pd.io.sql.read_sql(query, con = engine)

ratings.head()

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [11]:
# проверим размерности датасетов
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB

In [12]:
# получаем данные таблицы reviews
query = '''
            SELECT * FROM reviews
        '''
# подключения к базе данных для Sqlite
reviews = pd.io.sql.read_sql(query, con = engine)

reviews.head()

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

In [13]:
# проверим размерности датасетов
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB

`Посчитайем, сколько книг вышло после 1 января 2000 года`

In [14]:
sql  = '''
            SELECT 
                COUNT(book_id) as cnt
            FROM 
                books
                WHERE publication_date >= '2000-01-01'
       '''
pd.read_sql(sql, con = engine)

   cnt
0  821

**Вывод:**
 821 книга

In [15]:
sql  = '''
            SELECT 
                books.book_id, -- выводим id книги
                books.title, -- выводим наименование книги
                COUNT(DISTINCT reviews.review_id) as cnt_reviews,  -- число ревью
                AVG(ratings.rating) as avg_ratings -- средний рейтинг        
            FROM 
                books
            LEFT JOIN ratings ON ratings.book_id = books.book_id -- мёрджим таблицы ratings, books, reviews по схеме связей в задании
            LEFT JOIN reviews ON reviews.book_id = books.book_id 
            GROUP BY
                books.book_id
            ORDER BY
                cnt_reviews DESC --отсортируем по убыванию числа ревью
            LIMIT
               5 --выведем первые 5 строк 
       '''
pd.read_sql(sql, con = engine)

,book_id,title,cnt_reviews,avg_ratings
0,948,Twilight (Twilight #1),7,3.662500
1,497,Outlander (Outlander #1),6,4.125000
2,207,Eat Pray Love,6,3.395833
3,299,Harry Potter and the Chamber of Secrets (Harry...,6,4.287500
4,302,Harry Potter and the Prisoner of Azkaban (Harr...,6,4.414634

**Вывод:**
 Самое большое число ревью у Twilight (Сумерки)

` Определим издательство, которое выпустило наибольшее число книг толще 50 страниц`

In [16]:
sql  = '''
            SELECT
                publishers.publisher,
                COUNT(books.book_id) AS cnt
            FROM    
                books
            LEFT JOIN publishers ON books.publisher_id = publishers.publisher_id
            WHERE 
                num_pages > 50
            GROUP BY
                publishers.publisher
            ORDER BY
                cnt DESC
            LIMIT
                1
       '''
pd.read_sql(sql, con = engine)

       publisher  cnt
0  Penguin Books   42

**Вывод:**
 Наибольшее число книг которое выпустило издательство Penguin Books - 42.

`Определим автора с самой высокой средней оценкой книг, учитывая только книги с 50 и более оценками`

In [17]:
sql  = '''
                 SELECT
                    authors.author,
                    AVG(ratings.rating) AS avg_rating
                 FROM 
                     books
                 LEFT JOIN authors ON books.author_id = authors.author_id
                 LEFT JOIN ratings ON ratings.book_id = books.book_id
                 WHERE
                     books.book_id IN
                     (
                     SELECT
                          books.book_id
                     FROM
                          books    
                     LEFT JOIN ratings ON ratings.book_id = books.book_id     
                     GROUP BY
                          books.book_id
                     HAVING 
                          COUNT(ratings.rating_id) >= 50
                      )
                 GROUP BY
                    authors.author  
                 ORDER BY 
                    avg_rating DESC
                 LIMIT 5    
       '''
pd.read_sql(sql, con = engine)

                              author  avg_rating
0         J.K. Rowling/Mary GrandPré    4.287097
1  Markus Zusak/Cao Xuân Việt Khương    4.264151
2                     J.R.R. Tolkien    4.246914
3                  Louisa May Alcott    4.192308
4                       Rick Riordan    4.080645

**Вывод:**
 Автор с самой высокой средней оценкой Diana Gabaldon.

`Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.`

In [18]:
sql  = '''
            SELECT
                SUM(subq.cnt) / COUNT(subq.username) AS avg_cnt_reviews
            FROM
                (SELECT
                    reviews.username,
                    COUNT(reviews.review_id) AS cnt
                FROM
                    reviews
                WHERE reviews.username IN
                    (SELECT
                         ratings.username
                     FROM
                         ratings
                     LEFT JOIN books ON books.book_id = ratings.book_id
                     GROUP BY
                         ratings.username
                     HAVING
                         COUNT(ratings.rating_id) > 50)
                GROUP BY
                     reviews.username
                     ) AS subq

       '''
pd.read_sql(sql, con = engine).round()

   avg_cnt_reviews
0             24.0

**Вывод:**
 Среднее количество обзоров на пользователя с более чем 50 оценками - 24

### Общий вывод:

1. Самые популярные книги Хоббит, Сумерки и Гарри Поттер. Читатели любят приключения и фантастику.
2. Самый рейтинговый писатель - J.K. Rowling.   
3. Лидирующее издательство по выпуску книг - Penguin Books
4. Среднее количество обзоров на пользователя с более чем 50 оценками - 24